#include <stdio.h>
#include <locale.h>
#include <malloc.h>

int main() {
    setlocale(LC_ALL, "Russian");

    int** a;
    int i, j, n, flag = 0, sum;

    printf("\nВведит количество строк и столбцов массива: ");

    scanf_s("%d", &n);

    a = (int**)malloc(n * sizeof(int*));

    for (i = 0; i < n; i++) {
        a[i] = (int*)malloc(n * sizeof(int));
        for (j = 0; j < n; j++) {
            printf("Введите значение матрицы A[%d][%d]: ", i, j);
            scanf_s("%d", &a[i][j]);
        }
    }

    printf("\nИсходная матрица: \n\n");
    for (i = 0; i < n; i++) {
        printf("\n");
        for (j = 0; j < n; j++) {
            printf("%d ", a[i][j]);
        }
    }

    sum = n * (n + 1) / 2;

    for (i = 0; i < n; i++)
    {
        for (j = 0; j < n; j++)
        {
            if (a[i][j] < 1 || a[i][j] > n)   // если один из элементов строки меньше 1 или больше n ,
            {                                                 // то это не латинский квадрат,
                i = n;                                          // приравниваем счётчики i и j к n,
                j = n;                                          // что обеспечивает выход из циклов for
                flag = 1;                                      // объединичиваем flag  для нелатинских квадратов
            }
            sum += a[i][j];                         // прибавляем к sum очередной элемент строки
        }
        if (sum != sum)   // если сумма элементов в строке не равна нужной summa,
        {                      // то это не латинский квадрат (дальше делаем то же самое)
            i = n;
            j = n;
            flag = 1;
        }
        sum = 0;              // обнуляем переменную sum
    }
   
    if (flag == 0)    // если в строках не обнаружено несоответствие, то проверяем столбцы
    {
        for (i = 0; i < n; i++)
        {
            for (j = 0; j < n; j++)
            {
                if (a[i][j] < 1 || a[i][j] > n)   // если один из элементов столбца меньше 1 или больше n ,
                {                                                 // то это не латинский квадрат,
                    i = n;                                          // приравниваем счётчики i и j к n,
                    j = n;                                          // что обеспечивает выход из циклов for
                    flag = 1;                                      // объединичиваем flag  для нелатинских квадратов
                }
                sum += a[i][j];                         // прибавляем к sum очередной элемент строки
            }
            if (sum != sum)   // если сумма элементов в строке не равна нужной summa,
            {                      // то это не латинский квадрат (дальше делаем то же самое)
                i = n;
                j = n;
                flag = 1;
            }
            sum = 0;              // обнуляем переменную sum
        }
    }

    printf("\n");

    if (flag)
        printf("\nДанная квадратная матрица является латинским квдаратом.\n");
    else
        printf("\nДанная квадратная матрица не является латинским квдаратом.\n");

    for (i = 0; i < n; i++) {
        free(a[i]);
    }
    free(a);
    printf("\n");
    return 0;
}